#!/usr/bin/env python3
# -*- config: utf-8 -*-

# Вариант 12
# Путем вставок и удаления символов исправить ошибки:
# в слове прроцесор;
# во фразе теекстовыйфайл;
# во фразе програма и аллгоритм;
# во фразе процесор и паммять.
if __name__ == '__main__':
    s1 = 'пррцесор'
    s2 = 'теекстовыйфайл'
    s3 = 'програма и аллгоритм'
    s4 = 'процесор и паммять'

    s1 = s1[:2] + 'о' + s1[3:6] + s1[5:]
    s2 = s2[:2] + s2[3:10] + ' ' + s2[10:]
    s3 = s3[:7] + s3[6:13] + s3[14:]
    s4 = s4[:6] + s4[5:14] + s4[15:]
    print(
          f"пррцесор = {s1}\n"
          f"теекстовыйфайл = {s2}\n"
          f"програма и аллгоритм = {s3}\n"
          f"процесор и паммять = {s4}\n"
    )
